In [1]:
#Q.1
import pandas as pd
import numpy as np
from scipy import stats

In [ ]:
#Given
H0:mu1=mu2
H1:mu1!=mu2

In [2]:
#Data
df=pd.read_csv("cutlets.csv")
df.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [3]:
df.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [4]:
unitA=df['Unit A']

In [5]:
unitB=df['Unit B']

In [6]:
#Two-sample t-test
import statsmodels.api as sm
sm.stats.ttest_ind(unitA,unitB)

(0.7228688704677944, 0.47223947245995745, 68.0)

In [ ]:
#conclusion
      Here,pvalue= 0.47223947245995745 is greater than 0.05, so we accept H0
    Hence, we can conclude that there is significant difference in the diameter of the cutlet between two units.

In [7]:
#Q.2
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

In [8]:
df=pd.read_csv("labTAT.csv")

In [9]:
df.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [10]:
df.tail()

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

In [11]:
F, p= stats.f_oneway(df.iloc[:,0], df.iloc[:,1],df.iloc[:,2],df.iloc[:,3])

In [12]:
print(p)

2.1156708949992414e-57

In [13]:
if p<0.05:
    print("reject null hypothesis")
else:
    print("accept null hypothesis")

reject null hypothesis

In [14]:
#Q.3
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import chi2_contingency

In [15]:
buyerratio=pd.read_csv("BuyerRatio.csv")

In [16]:
buyerratio

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [17]:
ratio = buyerratio.drop('Observed Values', axis=1)

In [18]:
stat, pvalue, dof, expected = chi2_contingency(ratio)

In [19]:
expected

array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
       [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]])

In [20]:
dof

3

In [21]:
stat

1.595945538661058

In [22]:
pvalue

0.6603094907091882

In [23]:
if pvalue<0.05:
    print("reject null hypothesis")
else:
    print("accept null hypothesis")

accept null hypothesis

In [24]:
#Q.4(a)
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats
from scipy.stats import chi2_contingency

In [25]:
df=pd.read_csv("Costomer+OrderForm.csv")
df

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [26]:
df1=df.replace(('Error Free','Defective'),(1,0))
df1

     Phillippines  Indonesia  Malta  India
0               1          1      0      1
1               1          1      1      0
2               1          0      0      1
3               1          1      1      1
4               1          1      0      1
..            ...        ...    ...    ...
295             1          1      1      1
296             1          1      1      1
297             1          1      0      1
298             1          1      1      1
299             1          0      0      1

[300 rows x 4 columns]

In [27]:
stat, pvalue, dof, expected = chi2_contingency(df1)

In [28]:
Chisquares_results=stats.chi2_contingency(df1)
Chisquares_results

(112.74730231885849,
 1.0,
 897,
 array([[0.74793008, 0.73689052, 0.7424103 , 0.77276909],
        [0.74793008, 0.73689052, 0.7424103 , 0.77276909],
        [0.49862006, 0.49126035, 0.4949402 , 0.51517939],
        ...,
        [0.74793008, 0.73689052, 0.7424103 , 0.77276909],
        [0.99724011, 0.9825207 , 0.9898804 , 1.03035879],
        [0.49862006, 0.49126035, 0.4949402 , 0.51517939]]))

In [29]:
pvalue

1.0

In [30]:
if pvalue<0.05:
    print("reject null hypothesis")
else:
    print("accept null hypothesis")

accept null hypothesis

In [31]:
#Q.4(b)
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats
from statsmodels.stats.proportion import proportions_ztest

In [32]:
df=pd.read_csv("Faltoons.csv")
df

    Weekdays Weekend
0       Male  Female
1     Female    Male
2     Female    Male
3       Male  Female
4     Female  Female
..       ...     ...
395   Female    Male
396   Female  Female
397   Female  Female
398   Female    Male
399   Female  Female

[400 rows x 2 columns]

In [33]:
df1=df.replace(('Male','Female'),(1,0))
df1

     Weekdays  Weekend
0           1        0
1           0        1
2           0        1
3           1        0
4           0        0
..        ...      ...
395         0        1
396         0        0
397         0        0
398         0        1
399         0        0

[400 rows x 2 columns]

In [34]:
weekdays=df1['Weekdays']

In [35]:
weekend= df1['Weekend']

In [36]:
import statsmodels.api as sm
sm.stats.ttest_ind(weekdays,weekend)

(-4.038383581687957, 5.9013879428528154e-05, 798.0)

In [ ]:
pvalue=5.9013879428528154e-05

In [ ]:
#conclusion
      Here,pvalue= 0.039763239 is lessthan 0.05, so we reject H0